app/controllers/users_controller.rb

  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?
---
SELECT * FROM `users` WHERE (`users`.`activation_code` = 'a0485d40c80fa1d898eecdfdec41542c584b79b0') LIMIT 1

  def find_user
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)